[
  {
    "file": "experiments/squa_moln.js",
    "name": "Week1: Vera Molnar 1",
    "description": "A recreation of Vera Molnár's square art using Garrit Schaap's code example. Each cell has layered rectangles with random positions and bright, semi-transparent colors on a black background. I aimed for a vibrant, glowing effect."
  },
  {
    "file": "experiments/tri_moln.js",
    "name": "Week1: Vera Molnar 2",
    "description": "This variation uses triangles instead of squares, inspired by Vera Molnár's square art, using Garrit Schaap's code example. Each cell has layered triangles with randomized positions and pastel colors on a black background. I aimed for a gentle, dreamy effect."
  },
  {
    "file": "experiments/molnmore.js",
    "name": "Week1: Vera Molnar 3",
    "description": "This variation replaces the layered triangles with layered circles, increases the wobble variance, and uses a gradient alpha for a softer, more playful effect."
  },
  {
    "file": "experiments/noisePerlin1.js",
    "name": "Week1: Perlin's noise 1",
    "description": "A landscape art created using Perlin noise inspired by Garrit Schaap's noise example and The Coding Train. It features two layered mountains with subtle transparency to create depth, set against a soft blue sky. The mountains drift gently, giving a calm, dreamy motion."
  },
  {
    "file": "experiments/Perlinnight2.js",
    "name": "Week1: Perlin's noise 2",
    "description": "A night variation of my earlier landscape. I experimented with darker colors, increased hill height, and slightly changed the noise settings and I also added a moon to complete the scene."
  },
  {
    "file": "experiments/PerlinSnow.js",
    "name": "Week 2&3: Perlin's noise Snowfall 1",
    "description": "This variation builds on my earlier Perlin noise landscapes and adds a particle system inspired by the Coding Train's smoke effect code to create snowfall. The flakes drift softly down the canvas with fading transparency, giving a calm and peaceful first-snow winter mood."
  },
  {
    "file": "experiments/Perlinightstorm.js",
    "name": "Week 2&3: Perlin's noise Snowstorm 2",
    "description": "This is a variation of my snowfall piece where I modified the particle system to create a stormy effect. The snowflakes move faster, drift sideways, and vanish quicker, giving the feeling of a windy snowstorm, and the darker background adds to the mood."
  },
  {
    "file": "experiments/flowfield.js",
    "name": "Week 2&3: Flow field glow 1",
    "description": "With help from Barney Codes, I experimented with a flow field. Each line overlaps and blends, making the colors feel alive and change randomly on click."
  },
  {
    "file": "experiments/flowfield2ink.js",
    "name": "Week 2&3: Flow field ink 2",
    "description": "This variation draws pure black lines that twist and overlap in a chaotic way until the canvas is filled. I removed the interaction so the flow happens automatically. I added random stroke weights for a hand-drawn energy, and made the particles flow in opposite directions instead of just one."
  },
  {
    "file": "experiments/flowfieldcircles.js",
    "name": "Week 2&3: Flow field retro 3",
    "description": "This variation uses circles instead of the lines, in this retro-inspired flow field. I experimented with speed, colors, and frame count to create a chaotic but hypnotic movement."
  },
  {
    "file": "experiments/flowfieldsquars.js",
    "name": "Week 2&3: Flow field De Stijl 4",
    "description": "This variation is a De Stijl inspired, using square shapes and a bold color palette. I experimented with both the flow and color change speeds to make it very wavy and dynamic."
  },
  {
    "file": "experiments/balll.js",
    "name": "Week 4: Bouncy ball Tone.js",
    "description": "I made a playful Tone.js piece with a ball bouncing around the canvas. It changes color and plays a note every time it hits an edge, creating a fun interaction with sound and motion."
  }
]
